src/InformationRegisters/Scan_КлючевыеДатыПроцессов/Scan_КлючевыеДатыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КлючевыеДатыПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_ОбъектыКлючевыхДат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ОбъектыКлючевыхДат/Scan_ОбъектыКлючевыхДат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ОбъектыКлючевыхДат</name>
  <enumValues>
    <name>ЗаказНаЗавод</name>
  </enumValues>
  <enumValues>
    <name>Изделие</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЗакупку</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/Scan_КлючевыеДатыПроцессов/Forms/ФормаСписка/Module.bsl
//rarus agar 04.12.2020 16691 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если  Параметры.Свойство("Продукт") 
		И Параметры.Свойство("ЗаказНаЗавод")
		Тогда
		ОбъектыКлючевыхДат = Новый СписокЗначений;
		ОбъектыКлючевыхДат.Добавить(ПредопределенноеЗначение("Перечисление.Scan_ОбъектыКлючевыхДат.Изделие"));
		ОбъектыКлючевыхДат.Добавить(ПредопределенноеЗначение("Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод"));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектКлючевойДаты", ОбъектыКлючевыхДат, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		
		Объекты = Новый СписокЗначений;
		Объекты.Добавить(Параметры.Продукт);
		Объекты.Добавить(Параметры.ЗаказНаЗавод);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Объект", Объекты, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	ИначеЕсли  Параметры.Свойство("Продукт") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектКлючевойДаты", ПредопределенноеЗначение("Перечисление.Scan_ОбъектыКлючевыхДат.Изделие"), ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Объект",             Параметры.Продукт, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли  Параметры.Свойство("ЗаказНаЗавод") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектКлючевойДаты", ПредопределенноеЗначение("Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод"), ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Объект",             Параметры.ЗаказНаЗавод, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 04.12.2020 16691 --
